In [4]:
import pandas as pd
data=[1,2,3,4,5]
s=pd.Series([data])
s

0    [1, 2, 3, 4, 5]
dtype: object

In [10]:
student={"Name":["vishal","sakthi","vasanth"],
         "tamil":[90,80,70],
         "socil":[95,80,78],
         "science":[94,86,78]}
dataframe=pd.DataFrame(student)
dataframe

      Name  tamil  socil  science
0   vishal     90     95       94
1   sakthi     80     80       86
2  vasanth     70     78       78

In [11]:
dataframe["Name"]

0     vishal
1     sakthi
2    vasanth
Name: Name, dtype: object

In [13]:
dataframe.loc[0]

Name       vishal
tamil          90
socil          95
science        94
Name: 0, dtype: object

In [14]:
dataframe.loc[[0]]

     Name  tamil  socil  science
0  vishal     90     95       94

In [23]:
l=[[1],45]
l[0][0]

1

In [24]:
l=[[1,2,3],45]
l[0][1]

2

In [28]:
l=[[1],45]
l[1]

45

In [31]:
student={"Name":["vishal","sakthi","vasanth"],
         "tamil":[90,80,70],
         "socil":[95,80,78],
         "science":[94,86,78]}
dataframe=pd.DataFrame(student,index=["student1","student2","student3"])
dataframe

             Name  tamil  socil  science
student1   vishal     90     95       94
student2   sakthi     80     80       86
student3  vasanth     70     78       78

In [ ]:
dataf